package com.kostas.fortunecookie;

import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Canvas;
import android.graphics.Paint;
import android.graphics.PorterDuff;
import android.graphics.PorterDuffXfermode;
import android.graphics.Rect;
import android.graphics.RectF;
import android.os.Bundle;
import android.support.design.widget.FloatingActionButton;
import android.support.design.widget.Snackbar;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.util.Log;
import android.view.View;
import android.view.Menu;
import android.view.MenuItem;

import java.util.Random;

public class MainActivity extends AppCompatActivity {
    private int position;

    final private String[] sayingAnc = {
            "Ζώον δίπουν άπτερον",
            "Ο αναθρών ά όπωπε.",
            "Τι εστιν ό μίαν έχον φωνήν τετράπουν και δίπουν και τρίπουν γίνεται;",
            "Φύσει γαρ άνθρωπος, ό βούλεται, τούτο και οίεται.",
            "Πολέμιον ανθρώποις αυτοί εαυτοίς.",
            "Πάντες άνθρωποι φύσει ορέγονται του ειδέναι.",
            "Άνθρωπον ζητώ.",
            "Μέμνησο ότι άνθρωπος εί.",
            "Ως χαρίεν εστ’ άνθρωπος αν άνθρωπος ή.",
            "Σκιάς όναρ άνθρωπος.",
            "Πολλά τα δεινά κουδέν ανθρώπου δεινότερον πέλει.",
            "Ουκ ένι ιατρικήν είδέναι, όστις μη οίδεν ό τι εστίν άνθρωπος.",
            "Άπαξ άνθρωποι γεγόναμεν, δις δε ουκ έστι γενέσθαι.",
            "Θνητός γεγονώς άνθρωπε, μη φρόνει μέγα.",
            "Πρώτον μεν γαρ τρία ην τα γένη τα των ανθρώπων, ουχ ώσπερ νυν δύο.",
            "Άνθρωπος τελειωθείς βέλτιστον των ζώων, χωρισθέν δε νόμου και δίκης, χείριστον πάντων.",
            "Του ανθρωπίνου βίου ο μεν χρόνος στιγμή, η δε ουσία ρέουσα, η δε αίσθησις αμυδρά, η δε " +
                    "όλου του σώματος σύγκρισις εύσηπτος, η δε ψυχή ρόμβος, η δε τύχη δυστέκμαρτον, η δε φήμη άκριτον.",
            "Κάλλιστον κόσμος, ποίημα γαρ θεού.",
            "Κόσμον τονδε, τον αυτόν απάντων, ούτε τις θεών ούτε ανθρώπων εποίησεν, αλλ' ην αεί και έστιν και έστε πύρ αείζωον.",
            "Σκηνή πας ο κόσμος εστί και παίγνιον· ή μάθε παίζειν ή φέρε τας οδύνας.",
            "Τοις εγρηγορόσιν ένα και κοινόν κόσμον είναι, των δε κοιμωμένων έκαστον εις ίδιον αποστρέφεσθαι.",
            "Πάντων χρημάτων μέτρον άνθρωπος.",
            "Ο αναθρών ά όπωπε.",
            "Σκιάς όναρ άνθρωπος.",
            "Ουκ ένι ιατρικήν είδέναι, όστις μη οίδεν ό τι εστίν άνθρωπος.",
            "Γυμνοί ήλθομεν οι πάντες, γυμνοί και απελευσόμεθα.",
            "Θνητός γεγονώς άνθρωπε, μη φρόνει μέγα.",
            "Ουδέν κακόν αμιγές καλού.",
            "Αισχρόν το γ’ αισχρόν, καν δοκή καν μη δοκή.",
            "Πη παρέβην; Τι δ’ έρεξα;Τι δε μοι δέον ουκ ετελέσθη;",
            "Ανοήμονες βιούσι ού τερπόμενοι βιούν.",
            "Τον βίον μη, τω χρόνω βραχύν όντα, πράγμασιν κακοίς μακρόν ποιείν.",
            "Ο κόσμος αλλοίωσις, ο βίος υπόληψις.",
            "Άνθρωποι βίου δεόμενοι, πολλά και παντοία τεχνέονται.",
            "Μέτρον βίου το καλόν ου το του χρόνου μήκος.",
            "Βραχύς αιών.",
            "Θνητών όλβιος εις το τέλος ουδείς.",
            "Έξω του κόσμου το αποθανόν ου πίπτει.",
            "Ο θάνατος τυγχάνει ων, ως εμοί δοκεί, ουδέν άλλο ή δυοίν πραγμάτοιν διάλυσις, της ψυχής και του σώματος απ' αλλήλου.",
            "Ύπνω και θανάτω διδυμάοσιν.",
            "Κοινωνία γαρ ψυχή και σώματι διαλύσεως ουκ έστιν η κρείττον.",
            "Πολλά λαλείς, άνθρωπε, χαμαί δε τίθη μετά μικρόν. Σίγα, και μελέτα ζών έτι τον θάνατον.",
            "Άρα μη θανόντες τώ δοκείν ζώμεν μόνον," +
                    "Έλληνες άνδρες, συμφορά πεπτωκότες" +
                    "όνειρον εικάζοντες είναι τόν βίον;" +
                    "ή ζώμεν ημείς, τού βίου τεθνηκότος;",
            "Θανέειν πέπρωται άπασι.",
            "Εισί γάρ δή οι περί τάς τελετάς ναρθηκοφόροι μέν πολλοί, βάκχοι δε τε παύροι.",
            "Πάντα γαρ φύσει έχει τι θείον.",
            "Περί μεν θεών ουκ έχω ειδέναι, ούθ’ ως εισίν ουθ’ ως ουκ εισίν.",
            "Θεός ουδαμή ουδαμώς άδικος.",
            "Θεοί μεν γαρ εισίν. Εναργής γαρ αυτών εστιν η γνώσις.",
            "Τοις θεοίς τίθει τα πάντα.",
            "Έσσετ’ ήμαρ.",
            "Οι καιροί ου μενετοί.",
            "Πάντα εκκαλύπτων ο χρόνος εις το φως άγει.",
            "Από κύλικος μέχρι χειλέων πολλά πέλει.",
            "Όμοια γάρ ως επί το πολύ τα μέλλοντα τοις γεγονόσι.",
            "Άμες γ’ εσόμεθα πολλώ κάρρονες.",
            "Μέμνησο νέος ων, ως γέρων έση ποτέ.",
            "Αετού γήρας κορύδου νεότης.",
            "Αμές ποκ’ ήμες άλκιμοι νεανίαι."

    };

    final private String[] sayingGr = {
            "Ζώο δίποδο χωρίς φτερά",
            "",
            "Τι έχει 4 πόδια, μετά 2 πόδια και μετά 3;",
            "Από τη φύση του ο άνθρωπος, αυτό που θέλει, αυτό νομίζει",
            "Ο εχθρός του ανθρώπου είναι ο ίδιος εαυτός του",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Μια φορά γεννηθήκαμε άνθρωποι, δυο φορές όμως δεν είναι δυνατό να γίνουμε",
            "",
            "",
            "",
            "",
            "",
            "",
            "Για όλα τα πράγματα ο άνθρωπος είναι το μέτρο",
            "Αυτός που αναλογίζεται και κρίνει όσα έχει δει.",
            "ο άνθρωπος είναι τ’ όνειρο μιας σκιάς.",
            "Eίναι αδύνατο να ξέρει την ιατρική, αυτός που δεν ξέρει ακριβώς τι είναι ο άνθρωπος",
            "Γυμνοί ήρθαμε όλοι [σ’ αυτή τη ζωή], γυμνοί και θα φύγουμε",
            "Αφού γεννήθηκες θνητός άνθρωπε, μην έχεις μεγάλες ιδέες",
            "Κανένα κακό χωρίς κάποιο καλό",
            "Το κακό είναι κακό. κι αν φαίνεται κι αν δεν φαίνεται",
            "Πού παρέβην; τι έκανα; τι από αυτά που έπρεπε να κάνω δεν έγινε;",
            "Πάς ώσπερ άρτι γεγονώς εκ του ζην απέρχεται.",
            "Ο καθένας φεύγει απ’ τη ζωή, σαν να ‘ρθε τώρα μόλις.",
            "Οι ανόητοι ζουν χωρίς να είναι ευχαριστημένοι που ζουν.",
            "Τη ζωή [σου], μιας και είναι σύντομη, μην την κάνεις [να φαίνεται] μακριά με κακά πράγματα",
            "Ο κόσμος είναι μια [συνεχής] αλλαγή, η ζωή είναι γέννημα της φαντασίας.",
            "Οι άνθρωποι για να τα βγάλουν πέρα στη ζωή τους, μηχανεύονται πολλά και διάφορα",
            "Η αξία της ζωής μετριέται με την ωραιότητά της και όχι με το μήκος της",
            "Η ζωή είναι σύντομη",
            "Κανένας άνθρωπος δεν είναι τυχερός στο τέλος",
            "Ο,τι πεθαίνει δεν πέφτει έξω από τον κόσμο [δεν χάνεται]",
            "Ο θάνατος δεν είναι τίποτε άλλο, παρά ο διαχωρισμός δύο πραγμάτων, του ενός απ' το άλλο, δηλαδή της ψυχής από το σώμα.",
            "Ο ύπνος και ο θάνατος είναι δίδυμα αδέλφια",
            "Η ένωση της ψυχής και του σώματος [η γέννηση] δεν είναι με κανένα τρόπο καλύτερη από το χωρισμό τους [το θάνατο]",
            "Λόγια πολλά λες, άνθρωπε, σε λίγο θα πεθάνεις. Σώπα, κι ενόσω ακόμα ζείς, τον θάνατο μελέτα",
            "Μήπως ενώ έχουμε πεθάνει ζούμε μόνο κατά φαντασίαν," +
                    "εμείς οι Έλληνες, που έχομε περιπέσει σε συμφορά" +
                    "νομίζοντας ότι η ζωή είναι όνειρο;" +
                    "ή ζούμε εμείς, και έχει αποθάνει η ζωή;",
            "Είναι γραφτό σε όλους να πεθάνουν",
            "Πολλοί έλαβαν μέρος εις τα [Ελευσίνια]μυστήρια αλλά λίγοι είναι οι εκλεκτοί",
            "Σε όλα υπάρχει εκ φύσεως κάτι το θείο",
            "Σχετικά με τους θεούς, δεν ξέρω ούτε πώς είναι ούτε πώς δεν είναι.",
            "Ο Θεός δεν είναι ποτέ καθόλου άδικος",
            "Οι θεοί υπάρχουν σίγουρα, επειδή η γνώση που έχουμε γι’ αυτούς είναι εναργής",
            "Θα ‘ρθει η μέρα που…",
            "Οι καιροί [οι ευκαιρίες] δεν περιμένουν",
            "Ο χρόνος αποκαλύπτει τα πάντα και τα φέρνει στο φως",
            "από το ποτήρι μέχρι τα χείλη πολλά γίνονται",
            "Τα περισσότερα από αυτά που θα γίνουν στο μέλλον είναι ίδια μ’ αυτά που έχουν γίνει",
            "Και εμείς θα γίνουμε πολύ καλύτεροι [από εσάς]",
            "Να θυμάσαι όταν είσαι νέος ότι και συ θα γίνεις γέρος",
            "Του αετού τα γηρατειά ισοδυναμούν με του κορυδαλλού τα νιάτα.",
            "Ήμαστε κι εμείς κάποτε ρωμαλέοι νέοι."

    };

    final private String[] sayingEng = {
            "Two legged animal with no wings.",
            "",
            "What has 4 legs, then 2 and then 3?",
            "From the human nature, what they want to do, that is what they do.",
            "A man's enemy, is himself."
    };

    final private String[] philosopherGr = {
            "Ο ορισμός του ανθρώπου κατά τον Πλάτωνα",
            "Πλάτων",
            "Το αίνιγμα της Σφίγγας",
            "Ιούλιος Καίσαρ",
            "Ανάχαρσις",
            "Διογένης",
            "Φίλιππος Β’",
            "Μένανδρος",
            "Πίνδαρος",
            "Σοφοκλής",
            "Ιπποκράτης",
            "Επίκουρος",
            "Μένανδρος",
            "Σωκράτης",
            "Πλάτων",
            "Μάρκος Αυρήλιος",
            "Θαλής ο Μιλήσιος",
            "Ηράκλειτος",
            "Παλλαδάς ο Αλεξανδρεύς",
            "Ηράκλειτος",
            "Πλάτων",
            "Πλάτων",
            "Πίνδαρος",
            "Ιπποκράτης",
            "Αίσωπος",
            "Μένανδρος",
            "Αρχαίοελληνική παροιμία",
            "Αντισθένης",
            "Ερώτημα των Πυθαγορείων",
            "Επίκουρος",
            "Δημόκριτος",
            "Θαλής ο Μιλήσιος",
            "Δημόκριτος",

            "Ιπποκράτης",

            "Πλούταρχος",

            "Ευριπίδης",

            "Ευριπίδης",

            "Μάρκος Αυρήλιος",

            "Πλάτων",

            "Όμηρος",

            "Πλάτων",

            "Παλλαδάς ο Αλεξανδρεύς",

            "Παλλαδάς ο Αλεξανδρεύς",

            "Πυθαγόρας",

            "Πλάτων",

            "Αριστοτέλης",

            "Πρωταγόρας",

            "Πλάτων",

            "Επίκουρος",

            "Αρχίλοχος",

            "Όμηρος",
            "Θουκυδίδης",
            "Σοφοκλής",
            "Ειπώθηκε από δούλο του αργοναύτη Ανταίου",
            "Ευριπίδης",
            "Τραγούδι από το χορό των νέων στις γιορτές της αρχαίας Σπάρτης.",
            "Μένανδρος",
            "Αρχαιοελληνική παροιμία",
            "Τραγούδι από το χορό των γερόντων στις γιορτές της αρχ. Σπάρτης"
    };

    final private String[] getPhilosopherEng = {
            "Plato's definition of the human being",
            "Plato",
            "Sphinx's riddle",
            "Julius Caesar",
            "Anacharsis",
            "Diogenes",
            "Philip II of Macedon",
            "Menander",
            "Pindar",
            "Sophocles",
            "Hippocrates",
            "Epicurus",
            "Menander",
            "Socrates",
            "Plato",
            "Marcus Aurelius",
            "Thales of Miletus",
            "Heraclitus",
            "Paladas of Alexandria",
            "Heraclitus",
            "Plato",
            "Plato",
            "Pindar",
            "Hippocrates",
            "Aesop",
            "Menander",
            "Ancient greek proverb",
            "Antisthenes",
            "Pythagorians' question",
            "Epicurus",
            "Democritus",
            "Thales of Miletus",
            "Democritus",
            "Hippocrates",
            "Plutarch",
            "Euripides",
            "Euripides",
            "Marcus Aurelius",
            "Plato",
            "Homer",
            "Plato",
            "Paladas of Alexandria",
            "Paladas of Alexandria",
            "Pythagoras",
            "Plato",
            "Aristotle",
            "Protagoras",
            "Plato",
            "Epicurus",
            "Archilochus"

















    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        Log.e("Length", "is " + sayingAnc.length);

    }


    public String getQuote(String type) {
        String tmp;
        if (type.equals("anc")) {
            tmp = sayingAnc[position];
        } else if (type.equals("gr")){
            tmp = sayingGr[position];
        } else if (type.equals("eng")){
            tmp = sayingEng[position];
        } else {
            return null;
        }
        return tmp;
    }

    public String getPhilosopher(String type) {
        String tmp;
        if (type.equals("anc")) {
            tmp = philosopherGr[position];
        } else {
            return null;
        }
        return tmp;
    }

    public void showQuote(View view){
        position = (int) (Math.random() * sayingAnc.length);
        String anc, gr, phil;
        Intent intent = new Intent(this,tellerActivity.class);
        anc = getQuote("anc");
        Log.d ("POSITION", "" + position);
        gr = getQuote("gr");
        Log.d ("POSITION", "" + position);
        //eng = getQuote("eng");
        phil = getPhilosopher("anc");
        Log.d ("POSITION", "" + position);

        intent.putExtra("anc", anc);
        intent.putExtra("gr", gr);
        intent.putExtra("phil", phil);
        startActivity(intent);
    }
}
