package com.kostas.fortunecookie;

import android.content.Intent;
import android.graphics.Bitmap;
import android.graphics.Canvas;
import android.graphics.Paint;
import android.graphics.PorterDuff;
import android.graphics.PorterDuffXfermode;
import android.graphics.Rect;
import android.graphics.RectF;
import android.os.Bundle;
import android.support.design.widget.FloatingActionButton;
import android.support.design.widget.Snackbar;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.util.Log;
import android.view.View;
import android.view.Menu;
import android.view.MenuItem;

import java.util.Random;

public class MainActivity extends AppCompatActivity {
    private int position;

    final private String[] sayingAnc = {
            "1Πάντων χρημάτων μέτρον έστιν άνθρωπος, των μεν όντων ως έστιν, των δε ουκ όντων ως ουκ εστίν.",
            "2Ζώον δίπουν άπτερον",
            "3Άνθρωπος: ο αναθρών ά όπωπε.",
            "4Τι εστιν ό μίαν έχον φωνήν τετράπουν και δίπουν και τρίπουν γίνεται;",
            "5Φύσει γαρ άνθρωπος, ό βούλεται, τούτο και οίεται.",
            "6Πολέμιον ανθρώποις αυτοί εαυτοίς.",
            "7Πάντες άνθρωποι φύσει ορέγονται του ειδέναι.",
            "8Άνθρωπον ζητώ.",
            "9Μέμνησο ότι άνθρωπος εί.",
            "10Ως χαρίεν εστ’ άνθρωπος αν άνθρωπος ή.",
            "11Σκιάς όναρ άνθρωπος.",
            "12Πολλά τα δεινά κουδέν ανθρώπου δεινότερον πέλει.",
            "13Ουκ ένι ιατρικήν είδέναι, όστις μη οίδεν ό τι εστίν άνθρωπος.",
            "14Άπαξ άνθρωποι γεγόναμεν, δις δε ουκ έστι γενέσθαι.",
            "15Θνητός γεγονώς άνθρωπε, μη φρόνει μέγα.",
            "16Πρώτον μεν γαρ τρία ην τα γένη τα των ανθρώπων, ουχ ώσπερ νυν δύο.",
            "17Άνθρωπος τελειωθείς βέλτιστον των ζώων, χωρισθέν δε νόμου και δίκης, χείριστον πάντων.",
            "18Του ανθρωπίνου βίου ο μεν χρόνος στιγμή, η δε ουσία ρέουσα, η δε αίσθησις αμυδρά, η δε " +
                    "όλου του σώματος σύγκρισις εύσηπτος, η δε ψυχή ρόμβος, η δε τύχη δυστέκμαρτον, η δε φήμη άκριτον.",
            "19Κάλλιστον κόσμος, ποίημα γαρ θεού.",
            "20Κόσμον τονδε, τον αυτόν απάντων, ούτε τις θεών ούτε ανθρώπων εποίησεν, αλλ' ην αεί και έστιν και έστε πύρ αείζωον.",
            "21Σκηνή πας ο κόσμος εστί και παίγνιον· ή μάθε παίζειν ή φέρε τας οδύνας.",
            "22Τοις εγρηγορόσιν ένα και κοινόν κόσμον είναι, των δε κοιμωμένων έκαστον εις ίδιον αποστρέφεσθαι.",
            "23Πάντων χρημάτων μέτρον άνθρωπος.",
            "24Άνθρωπος: ο αναθρών ά όπωπε.",
            "25Σκιάς όναρ άνθρωπος.",
            "26Ουκ ένι ιατρικήν είδέναι, όστις μη οίδεν ό τι εστίν άνθρωπος.",
            "27Γυμνοί ήλθομεν οι πάντες, γυμνοί και απελευσόμεθα.",
            "28Θνητός γεγονώς άνθρωπε, μη φρόνει μέγα.",
            "29Ουδέν κακόν αμιγές καλού.",
            "30Αισχρόν το γ’ αισχρόν, καν δοκή καν μη δοκή.",
            "31Πη παρέβην; Τι δ’ έρεξα;Τι δε μοι δέον ουκ ετελέσθη;",
            "32Ανοήμονες βιούσι ού τερπόμενοι βιούν.",
            "33Τον βίον μη, τω χρόνω βραχύν όντα, πράγμασιν κακοίς μακρόν ποιείν.",
            "34Ο κόσμος αλλοίωσις, ο βίος υπόληψις.",
            "35Άνθρωποι βίου δεόμενοι, πολλά και παντοία τεχνέονται.",
            "36Μέτρον βίου το καλόν ου το του χρόνου μήκος.",
            "37Βραχύς αιών.",
            "38Θνητών όλβιος εις το τέλος ουδείς.",
            "39Έξω του κόσμου το αποθανόν ου πίπτει.",
            "40Ο θάνατος τυγχάνει ων, ως εμοί δοκεί, ουδέν άλλο ή δυοίν πραγμάτοιν διάλυσις, της ψυχής και του σώματος απ' αλλήλου.",
            "41Ύπνω και θανάτω διδυμάοσιν.",
            "42Κοινωνία γαρ ψυχή και σώματι διαλύσεως ουκ έστιν η κρείττον.",
            "43Πολλά λαλείς, άνθρωπε, χαμαί δε τίθη μετά μικρόν. Σίγα, και μελέτα ζών έτι τον θάνατον.",
            "44Άρα μη θανόντες τώ δοκείν ζώμεν μόνον," +
                    "Έλληνες άνδρες, συμφορά πεπτωκότες" +
                    "όνειρον εικάζοντες είναι τόν βίον;" +
                    "ή ζώμεν ημείς, τού βίου τεθνηκότος;",
            "45Θανέειν πέπρωται άπασι.",
            "46Εισί γάρ δή οι περί τάς τελετάς ναρθηκοφόροι μέν πολλοί, βάκχοι δε τε παύροι.",
            "47Πάντα γαρ φύσει έχει τι θείον.",
            "48Περί μεν θεών ουκ έχω ειδέναι, ούθ’ ως εισίν ουθ’ ως ουκ εισίν.",
            "49Θεός ουδαμή ουδαμώς άδικος.",
            "50Θεοί μεν γαρ εισίν. Εναργής γαρ αυτών εστιν η γνώσις.",
            "51Τοις θεοίς τίθει τα πάντα.",
            "52Έσσετ’ ήμαρ.",
            "53Οι καιροί ου μενετοί.",
            "54Πάντα εκκαλύπτων ο χρόνος εις το φως άγει.",
            "55Από κύλικος μέχρι χειλέων πολλά πέλει.",
            "56Όμοια γάρ ως επί το πολύ τα μέλλοντα τοις γεγονόσι.",
            "57Άμες γ’ εσόμεθα πολλώ κάρρονες.",
            "58Μέμνησο νέος ων, ως γέρων έση ποτέ.",
            "59Αετού γήρας κορύδου νεότης.",
            "60Αμές ποκ’ ήμες άλκιμοι νεανίαι."

    };

    final private String[] sayingGr = {"",
            "1",
            "2",
            "3",
            "4",
            "5Από τη φύση του ο άνθρωπος, αυτό που θέλει, αυτό νομίζει",
            "6Ο εχθρός του ανθρώπου είναι ο ίδιος εαυτός του",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14Μια φορά γεννηθήκαμε άνθρωποι, δυο φορές όμως δεν είναι δυνατό να γίνουμε",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "22Για όλα τα πράγματα ο άνθρωπος είναι το μέτρο",
            "23Αυτός που αναλογίζεται και κρίνει όσα έχει δει.",
            "24Από τη φύση του ο άνθρωπος, αυτό που θέλει, αυτό νομίζει",
            "25ο άνθρωπος είναι τ’ όνειρο μιας σκιάς.",
            "26Eίναι αδύνατο να ξέρει την ιατρική, αυτός που δεν ξέρει ακριβώς τι είναι ο άνθρωπος",
            "27Γυμνοί ήρθαμε όλοι [σ’ αυτή τη ζωή], γυμνοί και θα φύγουμε",
            "28Αφού γεννήθηκες θνητός άνθρωπε, μην έχεις μεγάλες ιδέες",
            "29Κανένα κακό χωρίς κάποιο καλό",
            "30Το κακό είναι κακό. κι αν φαίνεται κι αν δεν φαίνεται",
            "31Πού παρέβην; τι έκανα; τι από αυτά που έπρεπε να κάνω δεν έγινε;",
            "32Πάς ώσπερ άρτι γεγονώς εκ του ζην απέρχεται.",
            "33Ο καθένας φεύγει απ’ τη ζωή, σαν να ‘ρθε τώρα μόλις.",
            "34Οι ανόητοι ζουν χωρίς να είναι ευχαριστημένοι που ζουν.",
            "35Τη ζωή [σου], μιας και είναι σύντομη, μην την κάνεις [να φαίνεται] μακριά με κακά πράγματα",
            "36Ο κόσμος είναι μια [συνεχής] αλλαγή, η ζωή είναι γέννημα της φαντασίας.",
            "37Οι άνθρωποι για να τα βγάλουν πέρα στη ζωή τους, μηχανεύονται πολλά και διάφορα",
            "38Η αξία της ζωής μετριέται με την ωραιότητά της και όχι με το μήκος της",
            "39Η ζωή είναι σύντομη",
            "40Κανένας άνθρωπος δεν είναι τυχερός στο τέλος",
            "41Ο,τι πεθαίνει δεν πέφτει έξω από τον κόσμο [δεν χάνεται]",
            "42Ο θάνατος δεν είναι τίποτε άλλο, παρά ο διαχωρισμός δύο πραγμάτων, του ενός απ' το άλλο, δηλαδή της ψυχής από το σώμα.",
            "43Ο ύπνος και ο θάνατος είναι δίδυμα αδέλφια",
            "44Η ένωση της ψυχής και του σώματος [η γέννηση] δεν είναι με κανένα τρόπο καλύτερη από το χωρισμό τους [το θάνατο]",
            "45Λόγια πολλά λες, άνθρωπε, σε λίγο θα πεθάνεις. Σώπα, κι ενόσω ακόμα ζείς, τον θάνατο μελέτα",
            "46μτφρ: Μήπως ενώ έχουμε πεθάνει ζούμε μόνο κατά φαντασίαν," +
                    "εμείς οι Έλληνες, που έχομε περιπέσει σε συμφορά" +
                    "νομίζοντας ότι η ζωή είναι όνειρο;" +
                    "ή ζούμε εμείς, και έχει αποθάνει η ζωή;",
            "47Είναι γραφτό σε όλους να πεθάνουν",
            "48Πολλοί έλαβαν μέρος εις τα [Ελευσίνια]μυστήρια αλλά λίγοι είναι οι εκλεκτοί",
            "49Σε όλα υπάρχει εκ φύσεως κάτι το θείο",
            "50Σχετικά με τους θεούς, δεν ξέρω ούτε πώς είναι ούτε πώς δεν είναι.",
            "51Ο Θεός δεν είναι ποτέ καθόλου άδικος",
            "52Οι θεοί υπάρχουν σίγουρα, επειδή η γνώση που έχουμε γι’ αυτούς είναι εναργής",
            "53Θα ‘ρθει η μέρα που…",
            "54Οι καιροί [οι ευκαιρίες] δεν περιμένουν",
            "55Ο χρόνος αποκαλύπτει τα πάντα και τα φέρνει στο φως",
            "56από το ποτήρι μέχρι τα χείλη πολλά γίνονται",
            "57Τα περισσότερα από αυτά που θα γίνουν στο μέλλον είναι ίδια μ’ αυτά που έχουν γίνει",
            "58Και εμείς θα γίνουμε πολύ καλύτεροι [από εσάς]",
            "59Να θυμάσαι όταν είσαι νέος ότι και συ θα γίνεις γέρος",
            "60Του αετού τα γηρατειά ισοδυναμούν με του κορυδαλλού τα νιάτα.",
            "61Ήμαστε κι εμείς κάποτε ρωμαλέοι νέοι."

    };

    final private String[] sayingEng = {

    };

    final private String[] philosopherGr = {
            "Πρωταγόρας",
            "Πλάτων",
            "Πλάτων",
            "Το αίνιγμα της Σφίγγας",
            "Ιούλιος Καίσαρ",
            "Ανάχαρσις",
            "Διογένης",
            "Φίλιππος Β’",
            "Μένανδρος",
            "Πίνδαρος",
            "Σοφοκλής",
            "Ιπποκράτης",
            "Επίκουρος",
            "Μένανδρος",
            "Σωκράτης",
            "Πλάτων",
            "Μάρκος Αυρήλιος",
            "Θαλής ο Μιλήσιος",
            "Ηράκλειτος",
            "Παλλαδάς ο Αλεξανδρεύς",
            "Ηράκλειτος",
            "Πλάτων",
            "Πλάτων",
            "Πίνδαρος",
            "Ιπποκράτης",
            "Αίσωπος",
            "Μένανδρος",
            "Αρχαίοελληνική παροιμία",
            "Αντισθένης",
            "Ερώτημα των Πυθαγορείων",
            "Επίκουρος",
            "Δημόκριτος",
            "Θαλής ο Μιλήσιος",
            "Δημόκριτος",
            "Ιπποκράτης",
            "Πλούταρχος",
            "Ευριπίδης",
            "Ευριπίδης",
            "Μάρκος Αυρήλιος",
            "Πλάτων",
            "Όμηρος",
            "Πλάτων",
            "Παλλαδάς ο Αλεξανδρεύς",
            "Παλλαδάς ο Αλεξανδρεύς",
            "Πυθαγόρας",
            "Πλάτων",
            "Αριστοτέλης",
            "Πρωταγόρας",
            "Πλάτων",
            "Επίκουρος",
            "Αρχίλοχος",
            "Όμηρος",
            "Θουκυδίδης",
            "Σοφοκλής",
            "Ειπώθηκε από δούλο του αργοναύτη Ανταίου",
            "Ευριπίδης",
            "Τραγούδι από το χορό των νέων στις γιορτές της αρχαίας Σπάρτης.",
            "Μένανδρος",
            "Αρχαιοελληνική παροιμία",
            "Τραγούδι από το χορό των γερόντων στις γιορτές της αρχ. Σπάρτης"
    };

    final private String[] getPhilosopherEng = {
            "Protagoras",
            "Plato",
            "Plato",
            "Sphinx's riddle"
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        Log.e("Length", "is " + sayingAnc.length);

    }


    public String getQuote(String type) {
        String tmp;
        if (type.equals("anc")) {
            tmp = sayingAnc[position];
        } else if (type.equals("gr")){
            tmp = sayingGr[position];
        } else if (type.equals("eng")){
            tmp = sayingEng[position];
        } else {
            return null;
        }
        return tmp;
    }

    public String getPhilosopher(String type) {
        String tmp;
        if (type.equals("anc")) {
            tmp = philosopherGr[position];
        } else {
            return null;
        }
        return tmp;
    }

    public void showQuote(View view){
        position = (int) (Math.random() * sayingAnc.length);
        String anc, gr, phil;
        Intent intent = new Intent(this,tellerActivity.class);
        anc = getQuote("anc");
        Log.d ("POSITION", "" + position);
        gr = getQuote("gr");
        Log.d ("POSITION", "" + position);
        //eng = getQuote("eng");
        phil = getPhilosopher("anc");
        Log.d ("POSITION", "" + position);

        intent.putExtra("anc", anc);
        intent.putExtra("gr", gr);
        intent.putExtra("phil", phil);
        startActivity(intent);
    }
}
